load-testing/working-test.yml
config:
  target: 'http://localhost:5000'
  phases:
    - duration: 30
      arrivalRate: 2
      name: "Working test"
  
  variables:
    departments: 
      - "Computer Science"
      - "Information Technology"
    roles:
      - "STUDENT"
      - "FACULTY"

scenarios:
  - name: "Working Registration Test"
    flow:
      - post:
          url: "/api/auth/register"
          json:
            name: "Test User {{ $randomNumber(1, 1000) }}"
            email: "loadtest{{ $randomNumber(100000, 999999) }}@example.com"
            password: "password123"
            department: "{{ $pick(departments) }}"
            role: "{{ $pick(roles) }}"
            roll_no: "CS{{ $randomNumber(2020, 2024) }}{{ $randomNumber(10000, 99999) }}"
            division: "{{ $pick(['A', 'B']) }}"
          expect:
            - statusCode: 201
          capture:
            - json: "$.user.email"
              as: "userEmail"
      
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ userEmail }}"
            password: "password123"
          expect:
            - statusCode: 200